#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-YXkQpzU4dSjLQ4tj

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
2020/12/14 19:39:29 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/12/14 19:39:29 [INFO] Terraform version: 0.14.0  
2020/12/14 19:39:29 [INFO] Go runtime version: go1.15.2
2020/12/14 19:39:29 [INFO] CLI args: []string{"/usr/local/bin/terraform", "plan", "-out", "/terraform/terraform.tfplan", "-detailed-exitcode", "-var-file=/terraform/terraform.tfvars", "-lock=false", "-parallelism=10"}
2020/12/14 19:39:29 Loading CLI configuration from /tmp/cli.tfrc
2020/12/14 19:39:29 [INFO] CLI command args: []string{"plan", "-out", "/terraform/terraform.tfplan", "-detailed-exitcode", "-var-file=/terraform/terraform.tfvars", "-lock=false", "-parallelism=10"}
2020/12/14 19:39:29 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/12/14 19:39:30 [INFO] Failed to read plugin lock file .terraform/plugins/linux_amd64/lock.json: open .terraform/plugins/linux_amd64/lock.json: no such file or directory
2020/12/14 19:39:30 [INFO] backend/local: starting Plan operation
2020-12-14T19:39:30.334Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:39:30.419Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:39:30.419Z
2020-12-14T19:39:30.721Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020-12-14T19:39:30.724Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:39:30.772Z [INFO]  plugin.terraform-provider-null_v3.0.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:39:30.772Z
2020-12-14T19:39:30.897Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020-12-14T19:39:30.899Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:39:30.948Z [INFO]  plugin.terraform-provider-random_v3.0.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:39:30.947Z
2020-12-14T19:39:31.070Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/12/14 19:39:31 [INFO] terraform: building graph: GraphTypeValidate
2020-12-14T19:39:31.091Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:39:31.181Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:39:31.181Z
2020-12-14T19:39:31.634Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/12/14 19:39:31 [INFO] backend/local: plan calling Plan
2020/12/14 19:39:31 [INFO] terraform: building graph: GraphTypePlan
2020-12-14T19:39:31.663Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:39:31.756Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:39:31.755Z
2020/12/14 19:39:32 [INFO] ReferenceTransformer: reference not found: "var.cidr_block"
module.eks.aws_iam_role.eks_role: Refreshing state... [id=eks-cluster-role]
module.vpc.aws_vpc.main_vpc: Refreshing state... [id=vpc-01babbdac58565478]
2020/12/14 19:39:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for module.eks.aws_iam_role.eks_role during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSFargatePodExecutionRolePolicy: Refreshing state... [id=eks-cluster-role-20201214192616004300000001]
module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController: Refreshing state... [id=eks-cluster-role-20201214192616034600000005]
module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-cluster-role-20201214192616018900000004]
module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role-20201214192616040000000006]
module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSServicePolicy: Refreshing state... [id=eks-cluster-role-20201214192616009600000002]
module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-cluster-role-20201214192616014000000003]
2020/12/14 19:39:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for module.vpc.aws_vpc.main_vpc during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
module.vpc.aws_internet_gateway.main_internet_gateway: Refreshing state... [id=igw-04e943860e536cfb9]
2020/12/14 19:39:33 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for module.vpc.aws_internet_gateway.main_internet_gateway during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
module.vpc.aws_subnet.private_be: Refreshing state... [id=subnet-03aeb8f03893bfe27]
module.vpc.aws_subnet.private_db: Refreshing state... [id=subnet-056305fa9ee5e5d5c]
module.vpc.aws_subnet.public_fe: Refreshing state... [id=subnet-0b05f846c2abe0d5a]
module.vpc.aws_eip.nat_db: Refreshing state... [id=eipalloc-0a1f6c7c309ab774f]
module.vpc.aws_eip.nat_be: Refreshing state... [id=eipalloc-089b01dd5310315ab]
2020/12/14 19:39:33 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for module.vpc.aws_eip.nat_db during refresh.
      - .network_interface: was cty.StringVal(""), but now cty.StringVal("eni-0c0eb4287e8811db7")
      - .private_ip: was cty.StringVal(""), but now cty.StringVal("10.0.200.200")
      - .private_dns: was null, but now cty.StringVal("ip-10-0-200-200.ec2.internal")
      - .tags: was null, but now cty.MapValEmpty(cty.String)
      - .association_id: was cty.StringVal(""), but now cty.StringVal("eipassoc-03e1bb0aa1d3b98f4")
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy"
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController"
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 19:39:33 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for module.vpc.aws_eip.nat_be during refresh.
      - .private_ip: was cty.StringVal(""), but now cty.StringVal("10.0.100.29")
      - .network_interface: was cty.StringVal(""), but now cty.StringVal("eni-0794967cc4e0fe678")
      - .tags: was null, but now cty.MapValEmpty(cty.String)
      - .private_dns: was null, but now cty.StringVal("ip-10-0-100-29.ec2.internal")
      - .association_id: was cty.StringVal(""), but now cty.StringVal("eipassoc-0a115bf2dd78b345a")
2020/12/14 19:39:33 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_eks_cluster.eks_cluster, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .kubernetes_network_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .vpc_config[0].endpoint_private_access: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .vpc_config[0].endpoint_public_access: planned value cty.True does not match config value cty.NullVal(cty.Bool)
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
module.vpc.aws_nat_gateway.nat_gw_db: Refreshing state... [id=nat-0b36816d6cba40519]
2020/12/14 19:39:33 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
module.vpc.aws_nat_gateway.nat_gw_be: Refreshing state... [id=nat-049ae0c16f10750f4]
2020/12/14 19:39:33 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for module.vpc.aws_nat_gateway.nat_gw_db during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2020/12/14 19:39:33 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for module.vpc.aws_nat_gateway.nat_gw_be during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2020-12-14T19:39:33.325Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/12/14 19:39:33 [INFO] backend/local: plan operation completed
2020/12/14 19:39:33 [INFO] backend/local: writing plan output to: /terraform/terraform.tfplan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks_cluster"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::801210904757:role/eks-cluster-role"
      + status                = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-0b05f846c2abe0d5a",
            ]
          + vpc_id                    = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*